app/views/users/show.html.erb

<%= @user.name %>, <%= @user.email %> <%= @user.created_at %>
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"