app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "activation_digest") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

UPDATE "users" SET "email" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["email", "foobar@example.com"], ["password_digest", "$2a$10$1PxAoZrzAUjWSmylBNBF4.HnmBv7uJuojiGl0oKgySgMKrCYVRELe"], ["updated_at", "2020-09-04 07:58:03.061182"], ["id", 1]]
---
  def update
    if @user.update_attributes(user_params)